sCO2Channel-DES_05/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  7.773E6; //0; 2.5708554E7;

boundaryField
{
    BotWall
    {
	    	type			zeroGradient;
    }
    OtherWalls
    {
	    	type			zeroGradient;
    }

    Inlet
    {
        type               fixedValue;
        value              uniform 7.778E6;


    }
    Outlet
    {
        type               fixedValue;
        value              uniform 7.773E6;
    }
}

// ************************************************************************* //
