sCO2Channel-DES_05/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;

    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
//    transport       sutherland;
    transport       superTransport;
//    thermo          hConst;
    thermo          superH;
//    equationOfState PengRobinsonGas;
    equationOfState redlichKwong;
    specie          specie;
    energy          sensibleEnthalpy;
}


// Data for co2
mixture
{
    specie
    {
        nMoles      1;
        molWeight   44.01;
    }
    equationOfState
    {
        Pc           73.773e5;  //Pa
        Tc           304.13;    //K
        Vc           0.0021386; //m^3/kg
        omega        0.22394;  //Accentric factor
    }
    thermodynamics 
    {
          cpL          2327;
          cpG          1755;
       	  TSpike       306.49;
          SpikeWidth1   0.5;
          cpSpike1      40000;
          SpikeWidth2   1.8;
          cpSpike2      10000;
          SpikeWidth3   4.5;
          cpSpike3      3000;
          SpikeWidth4   14.5;
          cpSpike4      2000;
    }

/*
    thermodynamics 
    {
        Cp    839; //J/kg-K
        Hf      1;
    }
*/
    transport
    {
  /*    As          1.4792e-06;
        Ts          116;            */

		Pcr                    7.382E6;    //  Pa
		Trcoeff0	    	  -290.1;      //  -
		Trcoeff1			   0.9768;     //  -
		Trcoeff2			  -1.174E-6;   //  -

        muLcoeff0			    4.3994E-5;  //  -
		muLcoeff1			   -3.4594E-6;  //  -
		muLcoeff2			   -1.084E-7;   //  -
		muLcoeff3		       -2.16E-9;    //  -
		muLcoeff4			    5.1E-10;    //  -
		muLcoeff5			   -1.0481;     //  -

		muVcoeff0			    1.862E-5;   //  -
		muVcoeff1			    5.35E-9;    //  -
		muVcoeff2			    3.83E-10;   //  -
		muVcoeff3			   -1.6E-12;    //  -
		muVcoeff4			    1.8E-8;     //  -
		muVcoeff5			   -1.0465;     //  -

        PrLcoeff0			    3.031;      //  -
		PrLcoeff1			    0.1488;     //  -
		PrLcoeff2			    17.84;      //  -
		PrLcoeff3		    	1.625;      //  -
		PrLcoeff4			    3020;       //  -
		PrLcoeff5			    1423;       //  -

		PrVcoeff0			    5.617;      //  -
		PrVcoeff1			   -0.6724;     //  -
		PrVcoeff2			    1.743;      //  -
		PrVcoeff3			   -0.1171;     //  -
		PrVcoeff4			    0.136;      //  -
		PrVcoeff5			   -0.9548;     //  - 
    }
}


